app/views/categories/index.html.erb

SELECT "products".* FROM "products"  WHERE "products"."category_id" = $1  [["category_id", 1]]
---
          <div class="panel-body">
            <% unless category.products.first == nil %>