app/views/products/index.html.erb

    <tr>
      <% if product.pictures.size > 0 %>
---
SELECT  "pictures".* FROM "pictures"  WHERE "pictures"."product_id" = $1  ORDER BY "pictures"."id" ASC LIMIT 1  [["product_id", 1]]