app/views/products/show.html.erb

    <div class="col-sm-7">
      <% @product.pictures.each do |picture| %>
---
SELECT "pictures".* FROM "pictures"  WHERE "pictures"."product_id" = $1  [["product_id", 1]]